src/InformationRegisters/СведенияОДокументахОбменСКО/СведенияОДокументахОбменСКО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОДокументахОбменСКО</name>
  <resources>
    <name>ДокументОтчетности</name>
    <type>
      <types>DefinedType.ПредметЦиклаОбмена</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СведенияОДокументахОбменСКО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Делает запись в регистр.
// 
// Параметры:
// 	Документ - СправочникСсылка.ВходящиеДокументы, СправочникСсылка.ИсходящиеДокументы
// 	ДокументОтчетности - ОпределяемыйТип.ПредметЦиклаОбмена
Процедура ДобавитьЗапись(Документ, ДокументОтчетности) Экспорт
	
	Запись = РегистрыСведений.СведенияОДокументахОбменСКО.СоздатьМенеджерЗаписи();
	Запись.Документ = Документ;
	Запись.ДокументОтчетности = ДокументОтчетности;
	Запись.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
